requests/pull_chunks.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:quer="http://schemas.hp.com/ucmdb/1/params/query" xmlns:typ="http://schemas.hp.com/ucmdb/1/types" xmlns:prop="http://schemas.hp.com/ucmdb/1/types/props">
   <soap:Header/>
   <soap:Body>
      <quer:pullTopologyMapChunks>
         <quer:cmdbContext>
            <typ:callerApplication>Dimiter</typ:callerApplication>
         </quer:cmdbContext>
         <typ:ChunkRequest>
            <typ:chunkNumber>2</typ:chunkNumber>
            <typ:chunkInfo>
               <typ:numberOfChunks>20</typ:numberOfChunks>
               <typ:chunksKey>
                  <typ:key1>getObjectsByCondition</typ:key1>
                  <typ:key2>getObjectsByCondition4bcf0b4b6c9fb3a5837c9b544624dc51</typ:key2>
               </typ:chunksKey>
            </typ:chunkInfo>
         </typ:ChunkRequest>
         <!--Optional:-->
         <quer:queryTypedProperties>
            <!--Zero or more repetitions:-->
            <prop:typedProperties>
               <prop:type>node</prop:type>
               <prop:properties>
                  <!--Optional:-->
                  <prop:propertiesList>
                     <!--1 or more repetitions:-->
                     <prop:propertyName>name</prop:propertyName>

                     <prop:propertyName>monitored_by</prop:propertyName>
                  </prop:propertiesList>
                  <!--Optional:-->
               </prop:properties>
            </prop:typedProperties>
         </quer:queryTypedProperties>
      </quer:pullTopologyMapChunks>
   </soap:Body>
</soap:Envelope>